soap_requests/GetSecret.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <GetSecret xmlns="urn:thesecretserver.com">
      <token>{{ cur_user_token[0] }}</token>
      <secretId>{{ secret_id }}</secretId>
    </GetSecret>
  </soap:Body>
</soap:Envelope>